app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      Song.create(title: song[0], artist_id: Artist.find_by(name: song[1]))
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-04-13 20:46:38.472684"], ["updated_at", "2018-04-13 20:46:38.472684"]]
INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2018-04-13 20:45:21.011923"], ["updated_at", "2018-04-13 20:45:21.011923"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]